<a href="https://colab.research.google.com/github/jacob-siby/python_lab/blob/main/PandaSeries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#1.Write a Pandas program to add, subtract, multiple and divide two Pandas Series.

In [ ]:
import pandas as pd
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
ds = ds1 + ds2
print("Add two Series:")
print(ds)
print("Subtract two Series:")
ds = ds1 - ds2
print(ds)
print("Multiply two Series:")
ds = ds1 * ds2
print(ds)
print("Divide Series1 by Series2:")
ds = ds1 / ds2
print(ds)

Add two Series:
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtract two Series:
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiply two Series:
0     2
1    12
2    30
3    56
4    90
dtype: int64
Divide Series1 by Series2:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

#2. Write a Pandas program to convert a dictionary to a Pandas series.

In [ ]:
import pandas as pd
d={'Jacob':24,'Varsha':22,'Ben':21}
new =pd.Series(d)
print(new)

Jacob     24
Varsha    22
Ben       21
dtype: int64

#3.Write a Pandas program to convert the first column of a DataFrame as a Series

In [ ]:
import pandas as pd
d={'Height':[78,89,80],'Weight':[89,79,81],'Mark':[98,78,80]}
n_dat=pd.DataFrame(d)
n_s=pd.Series(n_dat['Height'])
print(n_s)
type(n_s)

0    78
1    89
2    80
Name: Height, dtype: int64
0    78
1    89
2    80
Name: Height, dtype: int64

pandas.core.series.Series

#4.Write a Pandas program to convert a Series of lists to one Series.

In [ ]:
import pandas as pd
a=[1,1,1,1,1]
b=[2,2,2,2,2]
c=[3,3,3,3,3]
n_s=pd.Series([a,b,c])
print(n_s)
ns1=n_s[0]
for i in range(1,3):
  for z in range(len(n_s[i])):
      ns1.append(n_s[i][z])
print(ns1)
n_s=pd.Series(ns1)
print(n_s)

0    [1, 1, 1, 1, 1]
1    [2, 2, 2, 2, 2]
2    [3, 3, 3, 3, 3]
dtype: object
[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]
0     1
1     1
2     1
3     1
4     1
5     2
6     2
7     2
8     2
9     2
10    3
11    3
12    3
13    3
14    3
dtype: int64

In [ ]:

l1 = [10,9,8,7]
l2 = [9,83]
l3 = [1,2,3,4,5]
s = pd.Series([l1,l2,l3])
print(s)
s = s.apply(pd.Series).stack().reset_index(drop=True)
print(s)

0      [10, 9, 8, 7]
1            [9, 83]
2    [1, 2, 3, 4, 5]
dtype: object
0     10.0
1      9.0
2      8.0
3      7.0
4      9.0
5     83.0
6      1.0
7      2.0
8      3.0
9      4.0
10     5.0
dtype: float64

#5.Write a Pandas program to create a subset of a given series based on value and condition

In [ ]:
import pandas as pd
ns=pd.Series([1,2,3,4,5,6,7,8,9,10])
ns2=ns[ns%2==0]
print(ns2)

1     2
3     4
5     6
7     8
9    10
dtype: int64

#6.Write a Pandas program to get the items which are not common of two given series.

In [ ]:
import pandas as pd
import numpy as np
ns1=pd.Series([0,1,2,3,5,9])
ns2=pd.Series([0,6,7,8,9])
nns1=pd.Series(np.union1d(ns1,ns2))
nns2=pd.Series(np.intersect1d(ns1,ns2))
result=nns1[~nns1.isin(nns2)]
print(result)

1    1
2    2
3    3
4    5
5    6
6    7
7    8
dtype: int64

#7.Write a Pandas program to calculate the frequency counts of each unique value of a given series.

In [ ]:
import pandas as pd
ns1=pd.Series([0,1,2,3,3,4,5,1,2,3,5,9])
ns1.value_counts()

3    3
5    2
2    2
1    2
9    1
4    1
0    1
dtype: int64

#8.Write a Pandas program to display most frequent value in a given series and replace everything else as 'Other' in the series.

In [ ]:
import pandas as pd
ns1=pd.Series([0,1,2,3,3,4,4,4,4,4,4,5,1,2,3,5,9])
s_c=ns1.value_counts()
ns1[~ns1.isin(s_c.index[:1])] = 'Other'
print(ns1)

0     Other
1     Other
2     Other
3     Other
4     Other
5         4
6         4
7         4
8         4
9         4
10        4
11    Other
12    Other
13    Other
14    Other
15    Other
16    Other
dtype: object

#9.Write a Pandas program to calculate the number of characters in each word in a given series.

In [ ]:
import pandas as pd
ns1=pd.Series(['Jacob','Varsha','Ben','Jordy'])
for i in range(len(ns1)):
  print(ns1[i],len(ns1[i]))

Jacob 5
Varsha 6
Ben 3
Jordy 5

#10.Write a Pandas program to convert a series of date strings to a timeseries.

In [68]:

import pandas as pd

pd.to_datetime(['2018-10-26 12:00 -0530', '2018-10-26 12:00 -0500'],utc=True)

DatetimeIndex(['2018-10-26 17:30:00+00:00', '2018-10-26 17:00:00+00:00'], dtype='datetime64[ns, UTC]', freq=None)

#11.Write a Pandas program to filter words from a given series that contain at least two vowels.

In [74]:
import pandas as pd
ns1=pd.Series(['Jacob','Varsha','Ben','Jordy'])
v='aeiouAEIOU'
for i in range(len(ns1)):
  c=0
  for z in range(len(ns1[i])):
   for t in range(len(v)):
     if ns1[i][z]==v[t]:
       c=c+1
  if c>=2:
    print(ns1[i])

Jacob
Varsha

#12.Write a Pandas program to create a TimeSeries to display all the Sundays of a given year.

In [75]:
import pandas as pd
result = pd.Series(pd.date_range('2020-01-01', periods = 52, freq = 'W-SUN'))
print("All Sundays in 2020:")
print(result)

All Sundays in 2020:
0    2020-01-05
1    2020-01-12
2    2020-01-19
3    2020-01-26
4    2020-02-02
5    2020-02-09
6    2020-02-16
7    2020-02-23
8    2020-03-01
9    2020-03-08
10   2020-03-15
11   2020-03-22
12   2020-03-29
13   2020-04-05
14   2020-04-12
15   2020-04-19
16   2020-04-26
17   2020-05-03
18   2020-05-10
19   2020-05-17
20   2020-05-24
21   2020-05-31
22   2020-06-07
23   2020-06-14
24   2020-06-21
25   2020-06-28
26   2020-07-05
27   2020-07-12
28   2020-07-19
29   2020-07-26
30   2020-08-02
31   2020-08-09
32   2020-08-16
33   2020-08-23
34   2020-08-30
35   2020-09-06
36   2020-09-13
37   2020-09-20
38   2020-09-27
39   2020-10-04
40   2020-10-11
41   2020-10-18
42   2020-10-25
43   2020-11-01
44   2020-11-08
45   2020-11-15
46   2020-11-22
47   2020-11-29
48   2020-12-06
49   2020-12-13
50   2020-12-20
51   2020-12-27
dtype: datetime64[ns]

#13.Write a Pandas program to find the index of the first occurrence of the smallest and largest value of a given series.

In [79]:
import pandas as pd
ns1=pd.Series([2,6,2,7,9,5,54,2,1,54])
print('1st Index of the maximum is',ns1.idxmax())
print('1st Index of the Minimum is',ns1.idxmin())

1st Index of the maximum is 6
1st Index of the Minimum is 8

#14.Write a Pandas program to get the first 3 rows of a given DataFrame.

In [80]:
import pandas as pd
d1 = {'Names':["Roy","Treesa","Ben","Jordy"],'Marks':[90,45,60,89]}
df = pd.DataFrame(data=d1)
df.head(3)

    Names  Marks
0     Roy     90
1  Treesa     45
2     Ben     60

#15.Write a Pandas program to select the 'name' and 'score' columns from a DataFrame.

In [86]:
import pandas as pd
d1 = {'Names':["Roy","Treesa","Ben","Jordy"],'Marks':[90,45,60,89],'Age':[22,21,24,21]}
df = pd.DataFrame(data=d1)
print(df[['Names','Marks']])

    Names  Marks
0     Roy     90
1  Treesa     45
2     Ben     60
3   Jordy     89

#16.Write a Pandas program to count the number of rows and columns of a DataFrame.

In [87]:
import pandas as pd
d1 = {'Names':["Roy","Treesa","Ben","Jordy"],'Marks':[90,45,60,89],'Age':[22,21,24,21]}
df = pd.DataFrame(data=d1)
print("Rows:",str(len(df.axes[0])))
print("Cols:",str(len(df.axes[1])))

Rows: 4
Cols: 3

#17.Write a Pandas program to add one row in an existing DataFrame

In [90]:
import pandas as pd
d1 = {'Names':["Roy","Treesa","Ben","Jordy"],'Marks':[90,45,60,89],'Age':[22,21,24,21]}
df = pd.DataFrame(data=d1)
print("Rows:",str(len(df.axes[0])))
print("Cols:",str(len(df.axes[1])))
df2 = {'Names': 'Vikram', 'Marks': 89, 'Age': 23}
df = df.append(df2, ignore_index = True)
df

Rows: 4
Cols: 3

    Names  Marks  Age
0     Roy     90   22
1  Treesa     45   21
2     Ben     60   24
3   Jordy     89   21
4  Vikram     89   23

#18.Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [91]:
import pandas as pd
d1 = {'Names':["Roy","Treesa","Ben","Jordy"],'Marks':[90,45,60,89],'Age':[22,21,24,21]}
df = pd.DataFrame(data=d1)
df.to_csv('new_file.csv', sep='\t', index=False)
new_df = pd.read_csv('new_file.csv')
print(new_df)

  Names\tMarks\tAge
0       Roy\t90\t22
1    Treesa\t45\t21
2       Ben\t60\t24
3     Jordy\t89\t21

#19.Write a Pandas program to replace all the NaN values with Zeros in a column of a dataframe.Write a Pandas program to drop a list of rows from a specified DataFrame.

In [96]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[np.nan, 2, 3, np.nan],
                   [3, 4, np.nan, 1],
                   [1, np.nan, np.nan, 5],
                   [np.nan, 3, np.nan, 4]])
df.fillna(value=0,inplace=True)
print(df)
l1=[1,2]
df = df.drop(df.index[l1])
print('After dropping')
print(df)

     0    1    2    3
0  0.0  2.0  3.0  0.0
1  3.0  4.0  0.0  1.0
2  1.0  0.0  0.0  5.0
3  0.0  3.0  0.0  4.0
After dropping
     0    1    2    3
0  0.0  2.0  3.0  0.0
3  0.0  3.0  0.0  4.0

#20.Write a Pandas program to shuffle a given DataFrame rows.

In [101]:
import pandas as pd
ODI_runs = {'name': ['Tendulkar', 'Sangakkara', 'Ponting',
                      'Jayasurya', 'Jayawardene', 'Kohli',
                      'Haq', 'Kallis', 'Ganguly', 'Dravid'],
            'runs': [18426, 14234, 13704, 13430, 12650,
                     11867, 11739, 11579, 11363, 10889]}
df = pd.DataFrame(ODI_runs)
print("Original DataFrame :")
print(df)
df = df.sample(frac = 1)
print("\nShuffled DataFrame:")
print(df)

Original DataFrame :
          name   runs
0    Tendulkar  18426
1   Sangakkara  14234
2      Ponting  13704
3    Jayasurya  13430
4  Jayawardene  12650
5        Kohli  11867
6          Haq  11739
7       Kallis  11579
8      Ganguly  11363
9       Dravid  10889

Shuffled DataFrame:
          name   runs
0    Tendulkar  18426
7       Kallis  11579
4  Jayawardene  12650
8      Ganguly  11363
9       Dravid  10889
6          Haq  11739
1   Sangakkara  14234
3    Jayasurya  13430
2      Ponting  13704
5        Kohli  11867

#21.Write a Pandas program to find the row for where the value of a given column is maximum.

In [111]:
import pandas as pd
d1 = {'Names':["Roy","Treesa","Ben","Jordy"],'Marks':[90,45,60,89],'Age':[22,21,24,21]}
df = pd.DataFrame(data=d1)
print(df.loc[df['Marks'].argmax()])

Names    Roy
Marks     90
Age       22
Name: 0, dtype: object

#22.Write a Pandas program to check whether a given column is present in a DataFrame or not.

In [112]:
import pandas as pd
d1 = {'Names':["Roy","Treesa","Ben","Jordy"],'Marks':[90,45,60,89],'Age':[22,21,24,21]}
df = pd.DataFrame(data=d1)
if 'Age' in df.columns:
  print("Age is present in DataFrame.")

Age is present in DataFrame.

#23.Write a Pandas program to append data to an empty DataFrame.

In [115]:
import pandas as pd
df = pd.DataFrame()
d1 = {'Names':["Roy","Treesa","Ben","Jordy"],'Marks':[90,45,60,89],'Age':[22,21,24,21]}
df1 = pd.DataFrame(data=d1)
df = df.append(df1)
print(df)

    Names  Marks  Age
0     Roy     90   22
1  Treesa     45   21
2     Ben     60   24
3   Jordy     89   21

#24.Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.

In [117]:
import pandas as pd
d1 = {'Names':["Roy","Treesa","Ben","Jordy"],'Marks':[90,45,60,89],'Age':[22,21,24,21]}
df = pd.DataFrame(data=d1)
print("Original DataFrame")
print(df)
print("\nAdd prefix:")
print(df.add_prefix("Stu_"))
print("\nAdd suffix:")
print(df.add_suffix("_Stu"))

Original DataFrame
    Names  Marks  Age
0     Roy     90   22
1  Treesa     45   21
2     Ben     60   24
3   Jordy     89   21

Add prefix:
  Stu_Names  Stu_Marks  Stu_Age
0       Roy         90       22
1    Treesa         45       21
2       Ben         60       24
3     Jordy         89       21

Add suffix:
  Names_Stu  Marks_Stu  Age_Stu
0       Roy         90       22
1    Treesa         45       21
2       Ben         60       24
3     Jordy         89       21

#25.Write a Pandas program to rename all columns with the same pattern of a given DataFrame.

In [121]:
import pandas as pd
d1 = {'Names':["Roy","Treesa","Ben","Jordy"],'Student Mark':[90,45,60,89],'Age':[22,21,24,21]}
df = pd.DataFrame(data=d1)
print(df.head())
df.columns = df.columns.str.lower().str.rstrip().str.replace(' ','_')
print("\nRemove trailing (at the end) whitesapce and convert to lowercase of the columns name")
print(df.head())

    Names  Student Mark  Age
0     Roy            90   22
1  Treesa            45   21
2     Ben            60   24
3   Jordy            89   21

Remove trailing (at the end) whitesapce and convert to lowercase of the columns name
    names  student_mark  age
0     Roy            90   22
1  Treesa            45   21
2     Ben            60   24
3   Jordy            89   21

#26.Write a Pandas program to convert continuous values of a column in a given DataFrame to categorical. 
Input:
{ 'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
'Age': [18, 22, 40, 50, 80, 5] }

In [122]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]
})
print("Original DataFrame:")
print(df)
print('\nAge group:')
df["age_groups"] = pd.cut(df["age"], bins = [0, 18, 65, 99], labels = ["kids", "adult", "elderly"])
print(df["age_groups"])

Original DataFrame:
             name  age
0  Alberto Franco   18
1    Gino Mcneill   22
2     Ryan Parkes   85
3    Eesha Hinton   50
4    Syed Wharton   80
5   Kierra Gentry    5

Age group:
0       kids
1      adult
2    elderly
3      adult
4    elderly
5       kids
Name: age_groups, dtype: category
Categories (3, object): ['kids' < 'adult' < 'elderly']

#27.Write a Pandas program to create DataFrames that contains random values, contains missing values, contains datetime values and contains mixed values.

In [123]:
import pandas as pd
print("DataFrame: Contains random values:")
df1 = pd.util.testing.makeDataFrame() # contains random values
print(df1)
print("\nDataFrame: Contains missing values:")
df2 = pd.util.testing.makeMissingDataframe() # contains missing values
print(df2)
print("\nDataFrame: Contains datetime values:")
df3 = pd.util.testing.makeTimeDataFrame() # contains datetime values
print(df3)
print("\nDataFrame: Contains mixed values:")
df4 = pd.util.testing.makeMixedDataFrame() # contains mixed values
print(df4)

DataFrame: Contains random values:
                   A         B         C         D
tReZDSbuK6  0.643885 -0.937988 -0.104933 -2.788647
pbClaYdZNw  1.374566 -1.103359  0.725064 -0.336734
MPJ9cqbKP2 -0.206672  0.892720 -0.241888 -0.341666
BY2zcWv2YX  1.264149  0.522255  0.151296  0.715088
IQl0f6Xuob -0.796751  0.764886  0.373501  0.280247
HFr8HhQ5iT  1.315168  1.732397  1.895020 -0.697715
1j3t0yA86X  0.282528 -0.814982 -1.425239 -0.321227
2KfHvLIUOh -0.789560 -0.577798  0.542555  0.240171
BPXRGamIhb -0.886273 -1.006601 -1.564734 -1.148707
zrqI4BgRAy  0.889916 -0.420012 -0.740229  0.963425
pO6RodGkZF -0.314201  1.226947 -0.505984 -0.744974
UfRHEVGXM0  0.223528 -0.797778 -0.761686 -0.057072
2UxDgS0tAK  0.656296  1.484714  1.753123 -0.111588
55YkpwjOV5  1.494834  0.963668 -0.414000  0.544367
bPo85CXqQy -1.242600  0.198342  0.450777 -0.632134
KFVyHwHEHP -0.279220  1.150519 -0.896795 -1.531236
VKIHcIzbAw -1.167578 -1.349640  2.180020  0.219413
HTrN03oKS0  1.598753  0.216017 -0.573801  0.650963
XJDnQKOX8c -1.418888 -1.503221  1.949184  1.744330
imWYaFIocZ -1.312189  1.296955  0.614397 -0.345645
MRdz7AOMdZ -1.227786  0.491392  1.371699  0.727130
e5ddxbTCcp  0.807314  0.417913 -0.938163  1.383684
Gd75idxd27 -0.792272  0.788539  0.840283 -0.562990
sotOcgL815 -0.458667  0.765284  2.361930  0.159170
pOO0AZVS18 -0.127795  0.356118 -0.111063 -0.831344
uWPr7HSOkn -0.184627 -0.806461 -0.519681 -0.871709
BQ3DZREZIo -0.101930  0.296759 -0.312268  2.100976
OUFzaefOtb  0.229024 -0.185995 -0.110497  1.116753
mDTzl0ozMI -0.966337  0.326609  0.832175  0.373444
37j3ujm1qS -0.394678 -0.041463  2.349588  0.024856

DataFrame: Contains missing values:
                   A         B         C         D
wbBetHjQCJ       NaN -2.065135  0.232959  1.073092
aaAUju09zb  1.109274 -1.028228 -1.817120  0.077621
nRgh7Q86Yd       NaN  0.256307  0.282721 -1.160519
x3f8AVpY1l  0.715309 -0.832164 -0.234392  0.430353
ne8nZKf2S3  1.513959       NaN -0.286243  0.378743
uZxQ8PaUs4 -0.109697  0.169869  0.191932 -0.547905
rxPxkGbzCh -0.557576       NaN       NaN  0.447268
a8icQgbCPL -0.935888  1.494869  2.387207  0.225389
GRsMjgzoow  1.490454  0.427074  0.094095  0.173670
4nvTheC4Rd -0.728144 -0.858929  1.540253  0.133507
C9qfQiiIyr -0.481343 -0.832511  0.700877 -0.470663
2JhPluBoHl -0.150916  0.945603       NaN -0.430439
5Cmzu5jpfC -0.698346 -0.546372 -0.481525 -0.217547
uUjSQ86rMP  0.861620 -1.094290  0.436276  0.304901
aDUV4EScCf -0.983611 -1.370727       NaN  0.062460
IxDj8hIwrw  0.211823 -1.225178 -0.734867 -0.963127
mgk838qbyZ  1.486598  2.459509 -1.191332 -0.070456
2i5YvpUwwy  1.782878  0.327652 -0.169131 -0.510073
izSltJy9is -0.115078 -2.003935  0.793234 -1.352779
rFT8hO71h6  0.859906 -0.053818  1.660392  1.148944
2j5nF8pVjN -1.675712  0.124568  1.454525  2.176817
bVHokWP5nT -0.453571 -0.171768  0.097541 -1.124393
8ylGiwPVjz -0.379425 -0.625502       NaN -1.209630
RC1Vz5Ly2L  0.364164 -0.395232  1.867819  0.530126
8COQsd9Rtg  1.977510  1.233025 -0.122353  2.194405
ZdVi0t4P67       NaN  1.071188 -0.630077 -0.792955
bEce30secd       NaN -1.427142 -1.269387  0.347942
6r9AzzSBjw  0.000701  0.278669  1.158476       NaN
ziKCK1ZoQK -0.493500 -1.688700       NaN -1.087308
vjsKlBkx09  0.640440 -0.180891 -0.683766 -1.073861

DataFrame: Contains datetime values:
                   A         B         C         D
2000-01-03 -0.168404  0.138583 -1.868594  1.224842
2000-01-04  0.960993  0.055241 -1.843814 -0.521740
2000-01-05  0.619702  0.219123 -0.547321 -0.642029
2000-01-06  0.249214  1.885230 -0.739146 -0.874150
2000-01-07  0.159988 -0.300579 -0.301215  1.119009
2000-01-10 -2.287916 -0.557075 -0.701339  1.775102
2000-01-11 -0.423581  0.644922  0.950882  0.380509
2000-01-12  0.352380 -1.637320 -1.274784 -0.407844
2000-01-13  1.439919  1.509433  0.581253 -0.515291
2000-01-14 -1.275730 -0.188908  0.109119  2.562674
2000-01-17 -0.383287  2.516209  0.485785  1.105757
2000-01-18  0.776010 -0.018694  0.791219 -1.682482
2000-01-19  0.413070 -0.126493 -1.218562  0.855054
2000-01-20  1.670066  0.382688  1.525353 -0.038230
2000-01-21  0.490708 -1.547150 -0.194504  1.083078
2000-01-24  0.505224  0.199606  0.334928  1.149462
2000-01-25 -1.229888  0.726663 -0.752312 -0.007215
2000-01-26 -2.079212  0.774271  0.979789 -0.610814
2000-01-27 -0.643218  0.155744  0.837222 -1.204230
2000-01-28 -1.584542 -0.716822 -1.553782 -0.161640
2000-01-31  0.606475 -0.771353  0.185675 -1.291972
2000-02-01  0.008564  1.189658 -0.550708 -2.187700
2000-02-02 -1.203146 -1.111042  0.565452 -1.074881
2000-02-03 -1.347690 -0.564234  0.931812  1.377035
2000-02-04  0.900592  0.100096 -0.009995 -1.785962
2000-02-07  0.219304  1.046408 -0.354496 -0.920885
2000-02-08 -0.375328  0.601367 -0.414591 -0.573753
2000-02-09 -0.653065 -0.428303 -2.086801 -0.315492
2000-02-10 -0.004064 -2.659265  1.395976  0.170566
2000-02-11  0.475902  1.229068 -0.024658 -1.393615

DataFrame: Contains mixed values:
     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

/usr/local/lib/python3.7/dist-packages/pandas/util/__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

#28.Write a Pandas program to join the two given dataframes along rows and assign all data.
student_data1:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
student_data2:
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [125]:
import pandas as pd
df1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

df2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})
df = pd.concat([df1, df2])
print(df)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201